[
  {
    "name": "Aberto",
    "type": "Charm",
    "pronunciation": "Uh-bare-toe",
    "description": "A spell presumably used to open objects such as doors or windows."
  
},
  {
    "name": "Accio",
    "define": "Summoning Charm",
    "type": "Charm",
    "pronunciation": "Various suggestions have been made, including: (AK-ee-oh) or (AK-see-oh)-film, (AK-see-oh)-UK audio book and video game, (AS-see-oh)-US audio book, and (AT-chee-oh)-Anglo-Catholic pronunciation Accio cup",
    "description": "This charm summons an object to the caster, potentially over a significant distance. It can be used in two ways, either by casting the charm and then naming the object desired, or by pointing your wand at the desired object during or immediately following the incantation to 'pull' the target toward the caster, in either case, the caster must concentrate on the object they wish to summon towards them in order for the charm to succeed. The caster does not necessarily need to know the location of the target if they say the name of the object to be summoned, such as when Hermione Granger summoned some books from Dumbledores office simply by saying 'Accio Horcrux books!' while in Gryffindor Tower.",
    "mentioned": "Harry Potter summoned his broom to complete the first task of the Triwizard Tournament in 1994, and to summon the Portkey to escape Voldemort and the Death Eaters in the Little Hangleton Graveyard in 1995. Also, in the Battle of the Seven Potters Harry summoned Hagrid when he fell. Molly Weasley used it to get the twins candy. The twins used it to summon their brooms from Dolores Umbridges office",
    "notes": "The summoning charm is limited only to items and small animals, as it was shown to be incapable of summoning people, it is also possible to bewitch items to become impervious to this spell.",
    "etymology": "The Latin word accio means 'I call' or 'I summon'."
  },
  {
    "name": "Age Line",
    "type": "Charm",
    "description": "Creates a thin, shimmering golden line around the target that is impassable by those below a set age. It seems that ageing potions are useless against the line, and it appears that the lines functions on either calendar or mental age.",
    "mentioned": "Used by Albus Dumbledore to stop underage students from entering their names into the Goblet of Fire."
  },
  {
    "name": "Aguamenti",
    "define": "Water-Making Spell",
    "type": "Charm / Conjuration",
    "pronunciation": "AH-gwah-MEN-tee",
    "description": "Produces a fountain or jet of water from the wand tip.",
    "mentioned": "Used by Fleur Delacour in 1994 to extinguish her skirt, which had caught flame during a fight against a dragon. Harry used this spell twice in 1997, both on the same night; once to attempt to provide a drink for Dumbledore, then again to help douse Hagrids hut after it was set aflame by Thorfinn Rowle, who used the Fire-Making Spell.",
    "etymology": "Possibly a hybrid of Latin words aqua, which means 'water', and mentis, which means 'mind'."
  },
  {
    "name": "Alarte Ascendare",
    "type": "Charm",
    "pronunciation": "A-LAR-tey ah-SEN-deh-rey",
    "description": "Shoots the target high into the air.",
    "mentioned": "Used only once, and that was by Gilderoy Lockhart in 1992",
    "etymology": "Ascendere is a Latin infinitive meaning 'to go up,' 'to climb,' 'to embark,' 'to rise(figuratively);'this is the origin of the English word 'ascend'."
  },
  {
    "name": "Albus Dumbledores Forceful Spell",
    "type": "Spell",
    "description": "This spell was, supposedly, quite powerful as when it was cast, the opponent was forced to conjure a silver shield to deflect it.",
    "mentioned": "This incantation was used only once throughout the series, and that was by Dumbledore in the Ministry of Magic, immediately following the Battle of the Department of Mysteries on 17 June, 1996, while he duelled Voldemort."
  },
  {
    "name": "Alohomora",
    "define": "Unlocking Charm",
    "type": "Charm",
    "pronunciation": "al-LOH-ha-MOHR-ah",
    "description": "Used to open and unlock doors; it can unseal doors upon which the Locking Spell has been cast, although it is possible to bewitch doors to resist the spell.",
    "mentioned": "Used by Hermione Granger in 1991 to allow her and her friends to access the Third-floor corridor] at her school, which was at the time forbidden; she used it again two years later to free Siriuss cell in her teachers prison room.",
    "etymology": "The incantation is derived from the West African Sidiki dialect used in geomancy; it means 'friendly to thieves', as stated by the author in testimony during a court case.",
    "notes": "Whilst in the first book, when the spell is cast the lock or door must be tapped once, in the fifth, a healer simply points her wand at the door to cast it, and on Pottermore the wand motion is seen as a backward 'S'."
  },
  {
    "name": "Anapneo",
    "type": "Healing Spell",
    "pronunciation": "ah-NAP-nee-oh",
    "description": "Clears the targets airway, should they find it blocked.",
    "mentioned": "Used only by Horace Slughorn, cast upon Marcus Belby when the latter choked on a pheasant in 1996.",
    "etymology": "From the Greek verb anapneo, meaning 'I breathe in'; this and Episkey are the only spells obviously derived from Greek."
  },
  {
    "name": "Anteoculatia",
    "type": "Hex",
    "pronunciation": "AN-tea-oh-cuh-LAY-chee-a",
    "description": "Anteoculatia is a hex which turns a persons hair into antlers.",
    "mentioned": "This spell was used to make Pansy Parkinson grow antlers in 1996."
  },
  {
    "name": "Anti-Jinx",
    "type": "Counter-Spell",
    "description": "Prevents the effects of a jinx over one target object or animal.",
    "mentioned": "In the summer of 1995, Arthur Weasley was required to perform an antijinx on a regurgitating toilet."
  },
  {
    "name": "Anti-Cheating Spell",
    "type": "Charm",
    "description": "Cast on parchment and quills to prevent the writer from cheating while writing answers.",
    "mentioned": "Used near exam times at Hogwarts in at least 1991 and 1995."
  },
  {
    "name": "Anti-Disapparition Jinx",
    "type": "Jinx",
    "description": "Used to prevent Disapparating in an area for a time; presumably used to trap an enemy in an area, is probably related to the Anti-Apparition Charm.",
    "mentioned": "Used by Albus Dumbledore to trap some Death Eaters in the Department of Mysteries in 1996. Also mentioned that nobody can disapparate from Hogwarts; it is due to this jinx."
  },
  {
    "name": "Antonin Dolohovs curse",
    "type": "Curse",
    "description": "Based on what is seen of the effects, it is presumed to be a lethal spell when used under the right conditions, it also causes severe internal injury.",
    "mentioned": "Used by Antonin Dolohov during the Battle of the Department of Mysteries twice.  Also used ineffectively (the silence charm weakened the curse and saved Hermione) under a silence charm on Hermione Granger (which incapacitated her instantly and required her to take ten potions a day for some time) and again, ineffectively, on Harry Potter."
  },
  {
    "name": "Aparecium",
    "define": "Revealing Charm",
    "type": "Charm",
    "pronunciation": "AH-par-EE-see-um",
    "description": "This spell is used to reverse concealing charms, and can presumably render invisible ink visible. It is covered in a rather old spellbook. It may be related to Specialis Revelio.",
    "mentioned": "Only ever used (to no avail) in 1993 by Hermione Granger to attempt to reveal any hidden writing in a diary.",
    "etymology": "Latin apparere, meaning 'to appear'; -ium and -cium are common Latin noun endings."
  },
  {
    "name": "Appare Vestigium",
    "type": "Charm",
    "pronunciation": "app-PAH-ray vest-EE-gee-um",
    "description": "This spell is used to reveal footprints and track marks."
  },
  {
    "name": "Apparate",
    "pronunciation": "aa-puh-ray-t",
    "description": "Teleportation spell, used to teleport the user and anyone touching them to a location. The destination is one that the primary user has been to or seen in some fashion previously. Any items on the individuals being apparated are also teleported. Does not require the use of an incantation or wand movement to perform.",
    "mentioned": "Used multiple times by various people. In year six, Dumbledore uses it to take Harry to visit Slughorn. Year seven, Hermione, Ron, and Harry use it as they search for the horcruxes."
  },
  {
    "name": "Aqua Eructo",
    "define": "Aqua Eructo Charm",
    "type": "Charm",
    "pronunciation": "A-kwa ee-RUCK-toh",
    "description": "This spell is used to create, and control, a jet of clear water from the tip of the wand; it is probably related to Aguamenti.",
    "mentioned": "Used multiple times to extinguish fires in 1994.",
    "etymology": "Aqua means, in Latin, water. Eructo is a verb meaning 'I raise'; roughly translated, it means 'I raise water'."
  },
  {
    "name": "Arania Exumai",
    "type": "Spell",
    "pronunciation": "ah-RAHN-ee-a EKS-su-may",
    "description": "This spell is used to blast away Acromantulas and, presumably, all other arachnids.",
    "mentioned": "Harry uses this spell in The Forbidden Forest to defend he and his friend from some spiders that are attacking them. He learned the spell from a diary, who attempted to use it in a memory.",
    "etymology": "From the Latin aranea, meaning 'spider', and exuo, meaning 'I lay aside'."
  },
  {
    "name": "Arresto Momentum",
    "type": "Charm",
    "pronunciation": "ah-REST-oh mo-MEN-tum",
    "description": "Used to decrease the velocity of a moving target; it should be noted that it can be used on multiple targets, as well as on the caster himself.",
    "mentioned": "Used by Dumbledore to save one of his students from a fall in 1993; Hermione Granger used it, to little effect, in 1998 to cushion an otherwise deadly fall.",
    "etymology": "Likely the combination of the Anglo-French arester, meaning 'to bring to a stop' and the Latin momentum, meaning 'the force or strength gained whilst moving'; the literal translation hence is 'Bring the force or strength gained whilst moving to a stop'."
  },
  {
    "name": "Arrow-shooting spell",
    "type": "Conjuration",
    "description": "Fires arrows from the casters wand.",
    "mentioned": "The spell used to be used by Appleby Arrows supporters at Quidditch matches to show their support for their teams; however, the British and Irish Quidditch League banned the use of the spell at matches when referee Nugent Potts was pierced through the nose with a stray arrow in 1894."
  },
  {
    "name": "Ascendi",
    "type": "Charm",
    "pronunciation": "ah-SEN-dee-oh",
    "description": "Lifts the caster high into the air.",
    "mentioned": "Used by Harry Potter in the Second Task of the Triwizard Tournament to propel him to the surface of the lake in 1995.",
    "etymology": "Derived from Latin ascendo, meaning 'to climb'."
  },
  {
    "name": "Avada Kedavra",
    "define": "Killing Curse",
    "article": "Unforgivable Curses",
    "type": "Curse",
    "pronunciation": "ah-VAH-dah keh-DAV-rah",
    "description": "Causes instant death to the victim wherever it hits on the body, is accompanied by a flash of green light and a rushing noise; there is no known counter-curse, although there are a number of ways to prevent death by it, such as hitting it with another spell in mid-flight, dodging it, or interrupting the caster. It is one of the three Unforgivable Curses.  Harry Potter was saved from this spell a number of times, both by his mothers sacrifice, because he was an accidental horcrux, and because his wand and his enemys were made of the same core.",
    "mentioned": "First said (not by name) in 1991, during the flashback while Hagrid described his parents deaths to Harry; next, the first part of the incantation was said by Lucius Malfoy when he tried to kill Harry, and numerous times in every book following.",
    "etymology": "During an audience interview at the Edinburgh Book Festival on 15 April, 2004 J. K. Rowling said 'Does anyone know where avada kedavra came from? It is an ancient spell in Aramaic, and it is the original of abracadabra, which means 'let the thing be destroyed'. Originally, it was used to cure illness and the 'thing' was the illness, but I decided to make the 'thing' as in the person standing in front of me. I take a lot of liberties with things like that. I twist them round and make them mine.'"
  },
  {
    "name": "Avifors",
    "define": "Avifors Spell",
    "type": "Transfiguration",
    "pronunciation": "AH-vi-fors",
    "description": "Transforms the target into a bird",
    "mentioned": "Used multiple times throughout the video games.",
    "etymology": "From Latin avis meaning 'bird' and forma meaning 'shape'."
  },
  {
    "name": "Avis",
    "define": "Bird-Conjuring Charm",
    "type": "Conjuration",
    "pronunciation": "AH-viss",
    "description": "Conjures a flock of birds from the tip of the wand; when used in conjunction with Oppugno, it can be used offensively.",
    "mentioned": "Used in 1994 by Mr Ollivander to test Viktor Krums wand. Also employed offensively by Hermione Granger against Ron Weasley.",
    "etymology": "The Latin word avis means 'bird'."
  },
  {
    "name": "Babbling Curse",
    "type": "Curse",
    "description": "Although this spell is not fully understood, it is generally presumed to force a person to babble whenever they speak; it is possibly, for this reason, related to the Tongue-Tying Curse.",
    "mentioned": "Although he was rather untrustworthy, it may not have occurred at all, but Lockhart says he cured a Transylvanian farmer of this affliction."
  },
  {
    "name": "Bat-Bogey Hex",
    "type": "Hex",
    "description": "It is another spell that is not fully understood, but most people presume, based on clues from the text, that it grotesquely enlarges the targets bogies, gives them wings, and sets them attacking the target.",
    "mentioned": "Ginny Weasley was a noted practitioner of this spell, having used it at least thrice by her sixth year.",
    "notes": "This spell may be related to, or the same as, the Curse of the Bogies mentioned in 1991; however, that spell gives the victim a runny nose, and hence the two may be different."
  },
  {
    "name": "Baubillious",
    "type": "Charm",
    "pronunciation": "baw-BILL-ee-us",
    "description": "The exact effects of the spell are unknown, though it presumably is of damaging nature and it produces a bolt of white light from the tip of the wand.",
    "mentioned": "In Charms class of an unknown year.",
    "etymology": "Currently unclear, probably from English bauble.",
    "notes": "Judging by the incantation, this may be the spell used by Filius Flitwick to decorate the Hogwarts Christmas Trees with Christmas baubles."
  },
  {
    "name": "Bedazzling Hex",
    "type": "Hex",
    "description": "Thouh the exact effects are unknown, based on the name (and the fact that it is used in conjunction with a chameleon charm on certain cloaks, it is probably used to conceal a person or object.",
    "mentioned": "When Xenophilius Lovegood explains the concept of how the Cloak of Invisibility is the only thing that can make a person truly invisible, he mentions that most cloaks of that kind are made with this spell."
  },
  {
    "name": "Bewitched Snowballs",
    "type": "Charm",
    "description": "Presumably causes snowballs to pelt themselves at the target.",
    "mentioned": "Twice used by Fred and George Weasley; firstly on Professor Quirrells head, unwittingly striking Lord Voldemort in the face, and then again four years later to attack the windows of Gryffindor Tower."
  },
  {
    "name": "Bluebell Flames",
    "type": "Charm",
    "description": "Conjures a quantity of waterproof blue flames that can be carried around in a container, released, then 'scooped' back therein.",
    "mentioned": "This spell was a specialty of Hermione Grangers. She used it to save Harry and Ron in 1991."
  },
  {
    "name": "Bombarda",
    "type": "Charm",
    "pronunciation": "bom-BAR-dah",
    "description": "Provokes a small explosion.",
    "mentioned": "Used by Hermione Granger to free Sirius Black from prison in 1994. This spell was only seen in the film.",
    "etymology": "Presumably from English bombard, meaning 'to attack a place or person continually with bombs or other missiles'."
  },
  {
    "name": "Bombarda Maxima",
    "type": "Charm",
    "pronunciation": "BOM-bar-dah MAX-ih-mah",
    "description": "Creates a large explosion capable of removing entire walls. A more advanced and more powerful form of Bombarda.",
    "mentioned": "Dolores Umbridge used this spell in 1995 to force her way into the Room of Requirement."
  },
  {
    "name": "Brackium Emendo",
    "type": "Charm, Healing Spell",
    "pronunciation": "BRA-key-um ee-MEN-doh",
    "description": "If used correctly, it is claimed that this spell will heal broken bones; this theory is supported by the etymology.",
    "mentioned": "Used unsuccessfully by Gilderoy Lockhart on Harry Potter in 1992 after the latters arm was broken by a Bludger; it vanished all the bones, making it resemble rubber."
  },
  {
    "name": "Bubble-Head Charm",
    "type": "Charm",
    "description": "Produces a large bubble of air around the head of the user; it is commonly used as the supernatural equivalent of a breathing set.",
    "mentioned": "Used by Cedric Diggory and Fleur Delacour in 1995; it was used the next year by many students walking through the halls, because of horrid odours made by various pranks played on Dolores Umbridge."
  },
  {
    "name": "Bubble-producing spell",
    "type": "Charm",
    "description": "Produces a stream of multicoloured, non-bursting bubbles; there are two similar spells.",
    "mentioned": "Used by Professor Flitwick to decorate some trees; the bubbles in this instance were golden. Used the following year by Ron Weasley when he broke his wand; these bubbles were purple."
  },
  {
    "name": "Calvario",
    "name": "Hair-Loss Curse",
    "type": "Curse",
    "pronunciation": "cal-VORE-ee-oh",
    "description": "This spell causes the victims hair to fall out.",
    "mentioned": "In the LEGO Harry Potter: Years 5-7, the book Curses and Counter-Curses by Vindictus Viridian mentions this spell, and it can be bought from Wiseacres Wizarding Equipment in Diagon Alley.",
    "etymology": "From Latin calvus = \"bald\"."
  },
  {
    "name": "Cantis",
    "type": "Jinx",
    "pronunciation": "CAN-tiss",
    "description": "Causes the victim to burst uncontrollably into song.",
    "mentioned": "This spell can be bought in Wiseacres Wizarding Equipment in LEGO Harry Potter: Years 5-7. Used by the Hogwarts professors to enchant suits of armour.",
    "etymology": "Cantare is Latin for 'sing'."
  },
  {
    "name": "Carpe Retractum",
    "define": "Seize and Pull Charm",
    "type": "Charm",
    "pronunciation": "CAR-pay ruh-TRACK-tum",
    "description": "Produces a supernatural rope from the casters wand, which will pull a target toward the caster.",
    "mentioned": "In 1993 and 1994 by Harry Potter and Ron Weasley.",
    "etymology": "From the Latin carpe, meaning 'to seize' and retracto, meaning 'I draw back'."
  },
  {
    "name": "Cascading Jinx",
    "type": "Jinx",
    "description": "An offensive spell used to defeat multiple enemies.",
    "mentioned": "This spell was seen only in Harry Potter and the Deathly Hallows: Part 1 (video game)."
  },
  {
    "name": "Caterwauling Charm",
    "type": "Charm",
    "description": "Anyone entering the perimeter of this spell sets off a high-pitched shriek. This spell may be related to the Intruder Charm.",
    "mentioned": "This spell was cast by the Death Eaters over Hogsmeade Wizarding Village to protect against intruders in 1998."
  },
  {
    "name": "Cauldron to Sieve",
    "type": "Transfiguration",
    "description": "Transforms cauldrons, and presumably all pots and containers of that sort, into sieves.",
    "mentioned": "This spell was only seen in the Harry Potter Trading Card Game."
  },
  {
    "name": "Cave Inimicum",
    "type": "Charm",
    "pronunciation": "KAH-way ih-NIH-mih-kum",
    "description": "Based on the etymology, it may warn the caster of any approaching enemies, similar to a Caterwauling Charm.",
    "mentioned": "Used multiple times by Hermione Granger in 1997 and 1998 to protect the tent she shared with Ron Weasley and Harry Potter.",
    "etymology": "The incantation is a Latin phrase which translates to 'beware of the enemy'."
  },
  {
    "name": "Cheering Charm",
    "type": "Charm",
    "description": "Causes the person upon whom the spell is cast to become contented and happy, though heavy-handedness with it causes the victim to break into an uncontrollable laughing fit.",
    "mentioned": "Taught to third-year charms classes, part of the written O.W.L. The spell was invented by Felix Summerbee."
  },
  {
    "name": "Cistem Aperio",
    "type": "Charm",
    "pronunciation": "SIS-tem uh-PE-ree-o",
    "description": "Opens chests and boxes",
    "mentioned": "This spell was used by Tom Riddle to open the chest in which Aragog was hidden. It was only seen in the film.",
    "etymology": "Aperio is Latin for 'uncover' or 'open'; Cista is Latin for 'trunk' or 'chest'."
  },
  {
    "name": "Colloportus",
    "define": "Locking Spell",
    "type": "Charm",
    "pronunciation": "cul-loh-POR-tus",
    "description": "Locks doors, and presumably all things that can be locked; it is unknown whether the counterspell is required, or if a key could open it.",
    "mentioned": "Used by Hermione Granger in 1996 in an attempt to prevent the Death Eaters that were following her from catching up.",
    "etymology": "Perhaps a portmanteau of the Latin words colligere, which means 'gather' and porta, which means 'gate'.",
    "notes": "This spell can easily be countered with Alohomora."
  },
  {
    "name": "Colloshoo",
    "define": "Stickfast Hex",
    "type": "Hex",
    "pronunciation": "cul-loh-SHOE",
    "description": "Adheres the victims shoes to the ground with some sort of adhesive ectoplasm.",
    "mentioned": "This spell is mentioned twice, once as having been used on Severus Snape during a potions class, the other when one reads Curses and Counter-Curses by Vindictus Viridian.",
    "etymology": "The suffix 'shoo' is a phonetic spelling of English 'shoe'; the prefix collo may come from Greek 'κολάω,κολώ' (pronounced 'colas','cols'), which means 'to glue'."
  },
  {
    "name": "Colovaria",
    "define": "Colour Change Charm",
    "type": "Charm",
    "pronunciation": "co-loh-VA-riah",
    "description": "Changes the targets colour.",
    "mentioned": "The spell can be bought in Wiseacres Wizarding Equipment in Diagon Alley. Used by fifth-years in their OWLs.",
    "etymology": "Almost certainly a combination of English 'colour' and 'vary'."
  },
  {
    "name": "Confringo",
    "define": "Blasting Curse",
    "type": "Curse",
    "pronunciation": "kon-FRING-goh",
    "description": "Causes anything that the spell comes into contact with to explode, and presumably thereafter burst into flame.",
    "mentioned": "Used by Harry Potter to destroy the side-car of a motorbike in which he was riding during a battle against some Death Eaters in 1997; it was later used by Hermione Granger in an attempt to kill Nagini and facilitate an escape from Godrics Hollow.",
    "etymology": "The incantation is direct Latin for 'destroy'.",
    "notes": "This spell seems to use heat for its explosion, while Expulso uses pressure instead."
  },
  {
    "name": "Confundo",
    "define": "Confundus Charm",
    "type": "Charm",
    "pronunciation": "con-FUN-doh",
    "description": "Causes the victim to become confused and befuddled.",
    "mentioned": "In 1994, Severus Snape asserted that Harry, Ron and Hermione had this charm cast on them so that they would believe Sirius Blacks claim of innocence; used two years later by Hermione to allow Ron to join the Gryffindor Quidditch team. It was used multiple times in 1997 and 1998.",
    "etymology": "The incantation, when non-capitalized, means 'I confuse'; the title may derive from the Latin confundere, meaning 'to confuse' or 'to perplex'."
  },
  {
    "name": "Conjunctivitis Curse",
    "type": "Curse",
    "description": "Due to the name (conjunctivitis is another word for 'pink eye', a disease which forms a scabby inflammation over the eye), it is presumed this curse causes great pain to the victims eyes.",
    "mentioned": "It was suggested by Sirius Black in his letter to Harry for him to use this spell on a dragon. Olympe Maxime used this spell on some giants in 1995."
  },
  {
    "name": "Cornflake skin spell",
    "description": "This spell causes the victims skin to appear as though it was coated in cornflakes.",
    "mentioned": "In 1996, an unnamed student went to the hospital for treatment after he was hit with it, which was presumably done in retaliation for the Inquisitorial Squad's recent behaviour."
  },
  {
    "name": "Cracker Jinx",
    "type": "Jinx",
    "description": "This spell is used to conjure exploding wizard crackers; it can be used in duelling to harm the opponent, but the force of the explosion may also affect the caster."
  },
  {
    "name": "Cribbing Spell",
    "type": "Spell",
    "description": "This spell, which may possibly be a charm, is used to assist the caster in cheating on written papers, tests, and exams. It is possible that these spells can negate anti-cheating spells.",
    "mentioned": "In 1991, an unnamed Slytherin student asked his fellow students whether any of them knew any good cribbing spells."
  },
  {
    "name": "Crinus Muto",
    "type": "Transfiguration",
    "description": "This spell can change the colour and style of ones hair.",
    "mentioned": "In the Harry Potter Lego video games.",
    "notes": "This maybe be the spell that causes Harry to turn his eyebrow yellow in 1996."
  },
  {
    "name": "Crucio",
    "define": "Cruciatus Curse",
    "article": "Unforgivable Curses",
    "type": "Curse",
    "pronunciation": "KROO-shea-oh",
    "description": "Inflicts intense pain on the recipient of the curse; the pain is described as having hot knives being driven into the victim. It cannot be cast successfully by a person who is doing so out of pure spite or anger; one must feel a true desire to cause the victim pain. If one casts this spell, he or she will receive a life sentence in Azkaban prison for it, as with the other two Unforgivable Curses.",
    "mentioned": "Used multiple times from the fourth book onward.",
    "etymology": "Latin crucio means 'I torture'."
  },
  {
    "name": "Mucus ad Nauseam",
    "define": "Curse of the Bogies",
    "type": "Curse",
    "pronunciation": "MEW-cuss add NOH-see-um",
    "description": "Gives the recipient a massive head cold and an extremely runny nose.",
    "mentioned": "Taught by Professor Quirrell to his first-year class, used later that year by Draco Malfoy on Harry Potter."
  },
  {
    "name": "Cushioning Charm",
    "type": "Charm",
    "description": "Produces an invisible cushion over the target, is used primarily in the manufacturing of broomsticks.",
    "mentioned": "Used by Hermione Granger to cushion her, Harry, and Ron's fall in Gringotts Wizard Bank in 1998.",
    "notes": "This spell may be related to Arresto Momentum and Spongify."
  },
  {
    "name": "Ears to kumquats",
    "type": "Transfiguration",
    "description": "This spell transforms the victim's ears into kumquats.",
    "mentioned": "In 1995, Luna Lovegood read The Quibbler upside down in order to reveal the secret charm, written in Ancient Runes."
  },
  {
    "name": "Ear-shrivelling Curse",
    "type": "Curse",
    "description": "Causes the target's ears to shrivel up.",
    "mentioned": "Sometime between 1989 and 1994, Bill Weasley's pen-friend sent him a hat with this curse on it."
  },
  {
    "name": "Ebublio",
    "define": "Ebublio Jinx",
    "type": "Jinx",
    "pronunciation": "ee-BUB-lee-oh",
    "description": "Causes the victim to inflate and explode into hundreds of bubbles; it can only be cast if an ally is using Aqua Eructo on the victim simultaneously.",
    "mentioned": "Used multiple times in 1994."
  },
  {
    "name": "mEngorgio",
    "define": "Engorgement Charm",
    "type": "Charm",
    "pronunciation": "en-GOR-jee-oh",
    "description": "Causes the target to swell in physical size.",
    "mentioned": "Rubeus Hagrid used this spell on his pumpkins in 1992; two years later, Barty Crouch Jr cast this spell on a spider to make it easier for students to see when he cast a curse on it. Used on another spider three years later to test a new wand.",
    "etymology": "The English word engorge means 'swell'.",
    "notes": "There is much speculation that this spell is the same as the Growth Charm, though this cannot be proven. Note that there is a difference between enlarging and engorging something, similar though they may seem."
  },
  {
    "name": "Engorgio Skullus",
    "type": "Charm",
    "pronunciation": "in-GORE-jee-oh SKUH-las",
    "description": "This hex causes the victim's skull to swell disproportionately; this spell may be a variation of the Engorgement Charm, as they share the first word of the incantation. Its countercurse is Redactum Skullus.",
    "mentioned": "This spell can be bought at Wiseacre's Wizarding Equipment in Diagon Alley.",
    "etymology": "See etymology for above entry; 'skullus' is Latin for 'skull'."
  },
  {
    "name": "Entomorphis",
    "type": "Jinx, Transfiguration",
    "pronunciation": "en-TOE-morph-is",
    "description": "This hex is used to transform the target into an insectoid for a short time; it can be bought at Wiseacre's Wizarding Equipment in Diagon Alley.",
    "mentioned": "Harry Potter contemplated using this hex against Dudley Dursley in 1995, though he decided against it; it was later seen in the LEGO world."
  },
  {
    "name": "Entrail-Expelling Curse",
    "type": "Curse",
    "description": "Presumably causes the victim's insides to be ejected from the body, though due to the fact that a portrait of its inventor was hung in a hospital, it is possible this spell's effect is entirely different.",
    "mentioned": "It was only ever seen once, and that was when Harry Potter visited a hospital in 1996, and he saw the inventor's portrait."
  },
  {
    "name": "Episkey",
    "type": "Healing Spell",
    "pronunciation": "ee-PISS-key",
    "description": "Used to heal relatively minor injuries, such as broken bones and cartilage.",
    "mentioned": "In 1996, Nymphadora Tonks used this spell to fix Harry's broken nose after Draco Malfoy broke it on the Hogwarts Express (Luna Lovegood did so in the film); Harry, in turn, used it to heal Demelza Robins' swollen lip after Ron punched her during Quidditch practise.",
    "etymology": "The word comes from Greek 'episkeui' ('επισκευή'), which means 'repair'.",
    "notes": "This is part of a family of healing spells."
  },
  {
    "name": "Epoximise",
    "type": "Transfiguration",
    "pronunciation": "ee-POX-i-mise",
    "description": "Adheres one object to another, similarly to if they had been glued together.",
    "mentioned": "As shown in the card game, this spell is often used by students to adhere each other's belongings to their desks (or, unfortunately, their hands).",
    "etymology": "Epoximise comes from the English word epoxy, which is a type of adhesive.",
    "notes": "This spell may be the Permanent Sticking Charm or a variation."
  },
  {
    "name": "Erecto",
    "type": "Charm",
    "pronunciation": "eh-RECK-toh",
    "description": "Used to erect a tent or other structure.",
    "mentioned": "Used by Hermione Granger to construct a shelter for her, Harry Potter, and Ronald Weasley in 1997.",
    "etymology": "Erectum is past principle of erigere, which is Latin for 'to erect'."
  },
  {
    "name": "Evanesce",
    "type": "Transfiguration",
    "pronunciation": "ev-an-ES-key",
    "description": "Vanishes the target",
    "mentioned": "Used on a mouse in the card game.",
    "notes": "This is probably simply an earlier version of the Vanishing Charm, which wasn't developed until later in the series' plot."
  },
  {
    "name": "Evanesco",
    "define": "Vanishing Spell",
    "type": "Transfiguration",
    "pronunciation": "ev-an-ES-koh",
    "description": "Vanishes the target; the best description of what happens to it is that it goes 'into non-being, which is to say, everything'.",
    "mentioned": "Used multiple times in 1995.",
    "etymology": "From 'evanescene', meaning 'something that is fleeting or disappears.'"
  },
  {
    "name": "Everte Statum",
    "type": "Spell",
    "pronunciation": "ee-VER-tay STAH-tum",
    "description": "Throws the victim backward, similarly to if they'd been thrown.",
    "mentioned": "Draco Malfoy used this spell on Harry Potter in 1992.",
    "etymology": "The Latin words everte, which means 'to throw out' and statua, from the same language, meaning 'image'."
  },
  {
    "name": "Expecto Patronum",
    "define": "Patronus Charm",
    "type": "Charm",
    "pronunciation": "ecks-PECK-toh pah-TROH-numb",
    "description": "This charm is a defensive spell which will conjure a spirit-like incarnation of their positive emotions to defend against dark creatures; it can also send messages to other witches or wizards. It seems one's Patronus will take the form of something important to the caster, and can change when one has undergone a period of heightened emotion.",
    "mentioned": "Taught to Harry by Professor Lupin; Harry later taught Dumbledore's Army this charm. This is the only known spell effective against Dementors or Lethifolds.",
    "etymology": "Patronus means 'protector' in Latin; in archaic Latin, it means 'father'; considering the form Harry's takes, this is interesting. The Latin word expecto means 'I await'"
  },
  {
    "name": "Expelliarmus",
    "define": "Disarming Charm",
    "type": "Charm",
    "pronunciation": "ex-PELL-ee-ARE-muss",
    "description": "Causes whatever the victim is holding to fly away, knocks out an opponent if used too forcefully. Harry Potter's special spell.",
    "mentioned": "Used multiple times from the second book onwards.",
    "etymology": "Probably a combination of Latin expello, meaning 'expel', and arma, meaning 'weapon'.",
    "notes": "Mentioned in Doctor Who starring David Tennant and Freema Agyeman, second episode of third series. It was also used differently in the Prisoner of Askaban PS2 video game, in which a pink coloured shield is formed to protect against jinxes."
  },
  {
    "name": "Expulso",
    "define": "Expulso Curse",
    "type": "Curse",
    "pronunciation": "ecks-PUHL-soh",
    "description": "Provokes an explosion, unique in that it uses pressure to do so as opposed to heat.",
    "mentioned": "Used by Antonin Dolohov during a fight in a cafe in 1997.",
    "etymology": "From expulsum, which is past principle of expellere, which means 'expel'."
  },
  {
    "name": "Extinguishing spell",
    "type": "Spell",
    "description": "Puts out fires.",
    "mentioned": "Charlie Weasley and his friends would use this spell should something go wrong in the tournament."
  },
  {
    "name": "Eye of rabbit, harp string hum, turn this water into rum",
    "type": "Transfiguration",
    "description": "Turns water into rum.",
    "mentioned": "Seamus Finnigan tried to cast it in 1991, and, in his first attempt, he managed to make 'weak tea,' before causing an explosion."
  },
  {
    "name": "Feather-light charm",
    "type": "Charm",
    "description": "Makes something lightweight.",
    "mentioned": "Harry Potter contemplated using this in 1993 to lighten his trunk so that he could carry it by broom to Gringotts, though he decided against it.",
    "notes": "This charm may have been cast by Hermione Granger on her beaded bag to make it easier to carry, considering the heavy objects within."
  },
  {
    "name": "Ferula",
    "type": "Healing Spell",
    "pronunciation": "feh-ROO-lah",
    "description": "Creates a bandage and a splint.",
    "mentioned": "Used by Remus Lupin in 1994 to bind Ronald Weasley's broken leg.",
    "etymology": "Latin ferula means 'walking-stick' or 'splint'."
  },
  {
    "name": "Fianto Duri",
    "define": "FiantoDurihs",
    "type": "Charm",
    "pronunciation": "fee-AN-toh DOO-ree",
    "description": "A defensive charm which, based on the etymology, strengthens shield spells, and perhaps objects in general, in a similar way to Duro.",
    "mentioned": "Used to protect a school in 1998.",
    "etymology": "Latin fiant means 'become' and duri means 'hard'."
  },
  {
    "name": "Fidelius Charm",
    "type": "Charm",
    "description": "A complex charm used to hide secret information within the soul of the charm's recipient, who is called a Secret-Keeper. The information is irretrievable unless the Secret-Keeper chooses to reveal it, and only the aforementioned person can do so.",
    "mentioned": "In 1993, it was explained that when Harry was merely an infant, he and his parents were hidden from Voldemort with this charm; from 1995 onward it was used to protect Grimmauld Place, and in 1998 it was used to protect Shell Cottage.",
    "etymology": "Latin fidelis, which means 'faithful'.",
    "notes": "Although the author had previously explained that when a Secret-Keeper dies the secret they held can never be revealed to anyone else[6], in 1997 it is clearly explained that upon the Keeper's death all those who had been told the secret become keepers in turn.  This charm seems to have no effect with regard to animals, as Hedwig found Ron and Hermione in a location that was protected by this charm; however, it is possible that Dumbledore somehow told her, ludicrous though such may seem.  In 1981, Hagrid managed to get to Harry before all the Muggles could look at it; this makes it appear as though the Killing Curse will negate the effect of the Fidelius Charm.  Those who have been told of the secret by secret-keepers still cannot pass the secret on, as proven by Severus Snape and Bellatrix Lestrange."
  },
  {
    "name": "Fiendfyre",
    "type": "Curse",
    "description": "Creates great spirits of fire which burn anything in its path, including nearly indestructable substances such as horcruxes. This fire is nearly impossible to control.",
    "mentioned": "Though there are numerous instances when it may have been used, it was only proven to have been used in 1998 by Vincent Crabbe, who was killed by it."
  },
  {
    "name": "Finestra",
    "type": "Charm",
    "pronunciation": "fi-Ness-Trah",
    "description": "Creates an aperture in a wall or window."
  },
  {
    "name": "Finite",
    "type": "Counter-Spell",
    "pronunciation": "fi-NEE-tay",
    "description": "Terminates spell effects in the vicinity of the caster.",
    "mentioned": "Remus Lupin used this spell on Neville Longbottom; three years later, Harry Potter used it to prevent an attack on his friend.",
    "etymology": "From Latin finire, meaning 'to finish'."
  },
  {
    "name": "Finite Incantatem",
    "define": "General Counter-Spell",
    "type": "Counter-Spell",
    "pronunciation": "fi-NEE-tay in-can-TAH-tem",
    "description": "Terminates all spell effects in the vicinity of the caster.",
    "mentioned": "Severus Snape used this to restore order to his club. Hermione Granger also used this in the film version of Harry Potter and the Chamber of Secrets to destroy Dobby's rogue Bludger after its Quidditch match.",
    "etymology": "Latin finire, meaning 'to finish', and incantatem."
  },
  {
    "name": "Finger-removing jinx",
    "type": "Jinx",
    "description": "Removes a person's fingers.",
    "mentioned": "Gunhilda Kneen jinxed her husband with this spell."
  },
  {
    "name": "Firestorm",
    "type": "Charm",
    "description": "Produces a ring of fire from the wand tip that can strike targets.",
    "mentioned": "Albus Dumbledore used this spell to rescue Harry from Inferi in 1997."
  },
  {
    "name": "Flagrante Curse",
    "type": "Curse",
    "description": "Causes the cursed object to burn human skin when touched.",
    "mentioned": "The Lestrange Vault had this curse on it."
  },
  {
    "name": "Flagrate",
    "type": "Charm",
    "pronunciation": "fluh-GRAH-tay",
    "description": "Produces fiery marks which can be used to write.",
    "mentioned": "Tom Riddle used this spell to write his name; Hermione Granger used it three years later to mark some doors.",
    "etymology": "From the Latin flagrate, meaning 'a burn'."
  },
  {
    "name": "Flame-Freezing Charm",
    "type": "Charm",
    "description": "Causes fire to tickle those caught in it instead of burning them.",
    "mentioned": "Third year students wrote an essay on the use of this charm in medieval witch-burnings; Wendelin the Weird was burned forty-seven times.",
    "notes": "This may be the spell used in Floo Network, as well as when Albus Dumbledore set Tom Riddle's wardrobe aflame in 1938."
  },
  {
    "name": "Flipendo",
    "define": "Knockback Jinx",
    "type": "Jinx",
    "pronunciation": "flih-PEN-doh",
    "description": "Pushes the target, knocks out weaker enemies.",
    "mentioned": "Taught in Defence Against the Dark Arts, used in every video game thereafter until the third one. Not used in the books or films."
  },
  {
    "name": "Flipendo Duo",
    "define": "Knockback Jinx Duo",
    "type": "Jinx",
    "pronunciation": "flih-PEN-doh DOO-oh",
    "description": "A more powerful version of Flipendo.",
    "mentioned": "Seen in 1991, 1992, and 1993."
  },
  {
    "name": "Flipendo Tria",
    "type": "Jinx",
    "pronunciation": "flih-PEN-doh TREE-ah",
    "description": "A more powerful version of Flipendo Duo; it is said to resemble a miniature tornado.",
    "mentioned": "In 1991 and 1993."
  },
  {
    "name": "Flying Charm",
    "type": "Charm",
    "description": "This spell is cast on broomsticks and flying carpets to allow them to fly.",
    "mentioned": "Draco Malfoy mentioned this spell when insulting Ron Weasley's broomstick, wondering why anyone would charm it."
  },
  {
    "name": "Fumos",
    "define": "Smokescreen Spell",
    "type": "Charm",
    "description": "Used to produce a defensive cloud of dark grey smoke.",
    "mentioned": "This spell, used in 1993, is covered in The Dark Forces: A Guide to Self-Protection."
  },
  {
    "name": "Fumos Duo",
    "type": "Charm",
    "description": "A more powerful version of Fumos.",
    "mentioned": "In 1993."
  },
  {
    "name": "Furnunculus",
    "define": "Pimple Jinx",
    "type": "Jinx",
    "pronunciation": "fer-NUN-kyoo-luss",
    "description": "Covers the target in boils (or pimples).",
    "mentioned": "Used by Harry Potter on Gregory Goyle.",
    "etymology": "Latin furnunculus, meaning 'petty thief', or English furuncle, a synonym for 'boil'."
  },
  {
    "name": "Fur spell",
    "type": "Charm",
    "description": "Causes fur to grow on the victim.",
    "mentioned": "Fred and George Weasley used this spell on each other."
  },
  {
    "name": "Hair-thickening Charm",
    "type": "Charm",
    "description": "Thickens the victim's hair.",
    "mentioned": "Alicia Spinnet was hexed with this spell in 1996."
  },
  {
    "name": "Harmonia Nectere Passus",
    "pronunciation": "har-MOH-nee-a NECK-teh-ray PASS-us",
    "type": "Charm",
    "description": "Repairs a Vanishing Cabinet.",
    "mentioned": "Used by Draco Malfoy to mend a cabinet in 1996.",
    "etymology": "Latin harmonia, which means 'harmony', nectere, which means 'to bind', and passus, which means 'step'."
  },
  {
    "name": "Herbifors",
    "type": "Transfiguration",
    "description": "This spell causes flowers to sprout from the victim.",
    "mentioned": "It can be bought at Wiseacre's Wizarding Equipment."
  },
  {
    "name": "Herbivicus",
    "define": "Herbivicus Charm",
    "type": "Charm",
    "pronunciation": "her-BIV-i-cuss",
    "description": "Makes plants grow to full size instantaneously.",
    "mentioned": "In 1994–1995 school year, not in books or films."
  },
  {
    "name": "Hermione's jinx",
    "type": "Jinx",
    "description": "Causes a traitor to break out in boils spelling 'SNEAK' on his or her forehead.",
    "mentioned": "Hermione Granger designed and placed this jinx on the parchment signed by all members of Dumbledore's Army. When Marietta Edgecombe betrayed the D.A. to Dolores Umbridge, the jinx was triggered.",
    "notes": "This jinx was invented by Hermione, and may have been inspired by Furnunculus."
  },
  {
    "name": "Homenum Revelio",
    "define": "Human-Presence-Revealing Spell",
    "type": "Charm",
    "pronunciation": "HOM-eh-num reh-VEH-lee-oh",
    "description": "Reveals human presence in the vicinity of the caster.",
    "mentioned": "Used multiple times by various people in 1997.",
    "etymology": "Most likely from Latin homo, meaning human, and 'reveal', though the classical Latin form would be hominem instead of homenum, which shows Portuguese influence ('man' is homem in Portuguese)—indeed, Rowling speaks the language.",
    "notes": "It can be used non-verbally; Dumbledore does so to detect Harry underneath his Invisibility Cloak."
  },
  {
    "name": "Homonculous Charm",
    "type": "Charm",
    "description": "Tracks movement of every person in the mapped area.",
    "mentioned": "Used to create the Marauder's Map."
  },
  {
    "name": "Homorphus Charm",
    "type": "Charm",
    "description": "Causes an Animagus or transfigured object to assume its normal shape.",
    "mentioned": "According to Lockhart, he used it to force the Wagga Wagga Werewolf to take its human form. It was, however, used by Lupin and Sirius on the rat named Scabbers to reveal that he was Peter Pettigrew in Prisoner of Azkaban.",
    "etymology": "Latin homo meaning 'person' and Greek morphosis meaning 'shaping'"
  },
  {
    "name": "Horton-Keitch",
    "define": "Braking Charm",
    "type": "Charm",
    "description": "This spell was first used on the Comet 140 to prevent players from overshooting the goal posts and from flying off-sides.",
    "mentioned": "Mentioned in Quidditch Through the Ages as the charm that gave the Comet 140 an advantage over the Cleansweep."
  },
  {
    "name": "Horcrux Curse",
    "define": "Horcruxes",
    "type": "Curse",
    "description": "This spell allows a part of a wizard's soul to pass into an object, thereby making the object a Horcrux. One has to commit murder and take advantage of the soul's 'splitting apart' by this supreme act of evil in order to be able to perform this spell, and it is probably very complex. In 1943, Horace Slughorn described the spell to a young Tom Riddle as encasing a portion of the torn soul and placing it within an object. The spell itself is described in detail in a banned book known as 'Secret of the Darkest Art', which Hermione Granger summoned from Albus Dumbledore's office near the end of their sixth year. According to the text, use of this spell to separate the soul will make the remaining portion of the soul very fragile, and can only be reversed by 'remorse' of the wrongs the creator had made; however, the pain caused by attempting to reverse the creation of a Horcrux can destroy the individual.",
    "mentioned": "Used by Lord Voldemort while creating his Horcruxes.",
    "notes": "When J.K.Rowling was asked about what the steps are to create a Horcrux Rowling declined to answer, saying that 'some things are better left unsaid'. However, in the Harry Potter Encyclopedia, it is explained, and the editor is said to have felt like vomiting after reading it."
  },
  {
    "name": "Hot-Air Charm",
    "type": "Charm",
    "description": "Causes wand to emit hot air.",
    "mentioned": "Used by Hermione Granger in 1995 to dry off her robes. Also used shortly after to melt snow. Also was used by Albus Dumbledore in 1997 to dry Harry's and his own robes. Quite possibly a form of Ventus."
  },
  {
    "name": "Hour-Reversal Charm",
    "type": "Charm",
    "description": "Reverses small amounts of time (up to five hours).",
    "mentioned": "Used to create Time-Turners, as mentioned by Professor Saul Croaker; this charm is highly unstable."
  },
  {
    "name": "Hover Charm",
    "type": "Charm",
    "description": "Causes the target to float in mid-air for a brief period of time.",
    "mentioned": "Used by Dobby to levitate a cake."
  },
  {
    "name": "Hurling Hex",
    "type": "Hex",
    "description": "Causes brooms to vibrate violently in the air and try to buck their rider off.",
    "mentioned": "In 1991, Professor Quirrell may have been casting a wordless and wandless version of this spell on Harry's broom during his Quidditch match. Professor Flitwick suggested that Harry's confiscated Firebolt may be jinxed with this spell.,"
  },
  {
    "name": "Locomotor Wibbly",
    "define": "Jelly-Legs Curse",
    "type": "Curse, Jinx",
    "pronunciation": "loh-koh-MOH-tor WIB-lee",
    "description": "Causes the victim's legs to collapse.",
    "mentioned": "One of the spells mentioned in Curses and Counter-Curses by Vindictus Viridian, used on Harry, practising for the Third Task of the Triwizard Tournament, by Hermione. Also, Draco Malfoy was hit with this jinx (along with another one) at the end of the term."
  },
  {
    "define": "Jelly-Brain Jinx",
    "type": "Jinx",
    "description": "Presumably affects the target's mental processes.",
    "mentioned": "During the September 1999 riot that took place during the Puddlemere United/Holyhead Harpies Quidditch game, a lot of Harpy supporters were using this jinx.",
    "notes": "This spell may have been the spell that the Death Eaters hit Ron with in Harry Potter and the Order of the Phoenix in the Battle of the Department of Mysteries."
  },
  {
    "define": "Jelly-Fingers Curse",
    "type": "Curse",
    "description": "Causes the target's fingers to become almost jelly-like to make it uneasy for the victim to grasp objects.",
    "mentioned": "After a June 1999 Pride of Portree/Appleby Arrows Quidditch game, the losing Seeker accused his opposite number of putting this curse on him as they both closed in on the Snitch."
  },
  {
    "name": "Lacarnum Inflamarae",
    "type": "Charm",
    "pronunciation": "la-CAR-num in-fla-MA-ray",
    "description": "It sends a ball of fire from the wand",
    "mentioned": "Used by Hermione in 1991 to stop Snape from cursing Harry. The incantation is only used in the film adaptation of Harry Potter and the Philosopher's Stone.",
    "etymology": "Latin inflammo, or the verb inflammatio meaning 'to set on fire'. Lacarnum, from the Latin 'lacerna', meaning 'cloak'."
  },
  {
    "name": "Langlock",
    "type": "Jinx",
    "pronunciation": "LANG-lock",
    "description": "Glues the subject's tongue to the roof of their mouth. Created by Severus Snape.",
    "mentioned": "Used by Harry on Peeves and twice on Argus Filch, to general applause.",
    "etymology": "Probably from the French langue ('tongue') and the English 'lock'."
  },
  {
    "name": "Lapifors",
    "define": "Lapifors Spell",
    "type": "Transfiguration",
    "pronunciation": "LAP-ih-forz",
    "description": "Turns targets into real rabbits.",
    "mentioned": "Used by Hermione in the Harry Potter and the Prisoner of Azkaban and Harry Potter and the Goblet of Fire video games.",
    "etymology": "From Latin lepus meaning hare, and forma meaning 'shape'."
  },
  {
    "define": "Leek Jinx",
    "type": "Jinx",
    "description": "Makes leeks sprout out of the target's ears.",
    "mentioned": "Used by a fighting Gryffindor fourth year and sixth year Slytherin before a Quidditch match in 1992."
  },
  {
    "name": "Legilimens",
    "define": "Legilimency Spell",
    "type": "Charm",
    "pronunciation": "Le-JIL-ih-mens",
    "description": "Allows the caster to delve into the mind of the victim, allowing the caster to see the memories, thoughts, and emotions of the victim.",
    "mentioned": "Used by Severus Snape on Harry after he had a dream about Arthur Weasley being attacked by Nagini in 1995. Also during Occlumency lessons in 1996. Also used non-verbally by Snape on Harry in 1997 to allow him to see where Harry had learned the Sectumsempra spell.",
    "etymology": "Latin legere ('to read') and mens ('mind')."
  },
  {
    "name": "Levicorpus",
    "type": "Jinx",
    "pronunciation": "lev-ee-COR-pus",
    "description": "The victim is dangled upside-down by their ankles, sometimes accompanied by a flash of light (this may be a variant of the spell).",
    "mentioned": "Apparently invented by the Half-Blood Prince; it is a non-verbal-only spell (although it is whispered by Hermione in 1997). Harry Potter learnt it by reading the notes written by the Half-Blood Prince. He used it on Ron. The previous year, Harry had seen (through the Pensieve used by Severus Snape) his father, James Potter, use the spell against Professor Snape. In the Order of the Phoenix film, Luna Lovegood somehow uses this against a Death Eater, although she speaks it, and the spell's name is unknown to any students until Half-Blood Prince.",
    "etymology": "Latin levare, 'raise' and corpus, 'body' or 'corpse'."
  },
  {
    "name": "Liberacorpus",
    "type": "Counter-Spell",
    "pronunciation": "LIB-er-ah-cor-pus",
    "description": "Counteracts Levicorpus.",
    "mentioned": "Harry used the spell in 1996 to counteract Levicorpus he had inadvertently cast on Ron.",
    "etymology": "Latin liberare, 'to free', and corpus, 'body' or 'corpse'.",
    "notes": "It is not clear why Levicorpus has a specific counter-spell, and is not neutralised by simply using Finite Incantatem, although this could be due to the fact that Snape invented the spell and therefore made it irreversible except by its specific counter-curse."
  },
  {
    "name": "Locomotor",
    "define": "Locomotion Charm",
    "type": "Charm",
    "pronunciation": "LOH-koh-moh-tor",
    "description": "The spell is always used with the name of a target, at which the wand is pointed (e.g. 'Locomotor Trunk!'). The spell causes the named object to rise in the air and move around at the will of the caster.",
    "mentioned": "Used by Nymphadora Tonks in Harry Potter to move Harry's trunk from his room. Filius Flitwick similarly used it to move Sybill Trelawney's trunk after Dolores Umbridge sacked her. Parvati Patil and Lavender Brown used this spell to race their pencil cases around the edges of the table. A variation seen in 1998 is Piertotum Locomotor, which caused the statues of Hogwarts to be animated.",
    "etymology": "Latin locus (place) and moto, 'set in motion' (passive motor), or English locomotion."
  },
  {
    "name": "Locomotor Mortis",
    "define": "Leg-Locker Curse",
    "type": "Curse",
    "pronunciation": "LOH-koh-moh-tor MOR-tis",
    "description": "Locks the legs together, preventing the victim from moving the legs in any fashion.",
    "mentioned": "Used by Draco Malfoy on Neville Longbottom in 1991. Used by Harry Potter on Draco Malfoy, who deflected it, in 1996. One of the spells on Pottermore.",
    "etymology": "English locomotion, 'movement' + Latin mortis, 'of death'.",
    "notes": "It is unclear whether or how this spell is related to the Locomotor spell. It could, however, be that the curse 'locks' any part of the body in accordance to where it is pointed, or moves the body into a position of the caster's choosing whilst placing them into an immobile state. It is possible that Draco had pointed his wand at Neville and the curse 'locked' his legs together.  It can be bought at Wiseacre's Wizarding Equipment in Diagon Alley in LEGO Harry Potter: Years 1-4."
  },
  {
    "name": "Lumos",
    "define": "Wand-Lighting Charm",
    "type": "Charm",
    "pronunciation": "LOO-mos",
    "description": "Creates a narrow beam of light that shines from the wand's tip, like a torch.",
    "mentioned": "Constantly throughout the series. A stronger version of this spell, Lumos Maxima is performed by Harry Potter at the Dursleys' house in the film adaptation of Harry Potter and the Prisoner of Azkaban, and by both Harry and Dumbledore in the Crystal Cave in the film adaptation of Harry Potter and the Half-Blood Prince. Used in Pottermore.",
    "etymology": "Latin lumen, 'light'.",
    "notes": "opposite incantation, Nox, puts the light out."
  },
  {
    "name": "Lumos Duo",
    "type": "Charm",
    "pronunciation": "LOO-mos DOO-oh",
    "description": "Creates an intense beam of light that projects from the wand's tip and can lock-on to various targets, turn hinkypunks solid and cause ghouls to retreat.",
    "mentioned": "Learned and used by Ron in the video game adaptation of Harry Potter and the Prisoner of Azkaban.",
    "etymology": "Lumos plus Latin duo, 'two'."
  },
  {
    "name": "Lumos Maxima",
    "type": "Charm",
    "pronunciation": "LOO-mos Ma-cks-ima",
    "description": "Shoots a ball of light at the place pointed, if the Wand is swung.",
    "mentioned": "First practised by Harry in the home of the Dursleys, then used by Dumbledore to light up the cave of the Horcrux.",
    "etymology": "Lumos + maxima, Latin 'greatest.'"
  },
  {
    "name": "Lumos Solem",
    "type": "Charm",
    "pronunciation": "LOO-mos SO-lem",
    "description": "Creates a powerful ray of light as bright as the sun.",
    "mentioned": "Used by Hermione to free Ron from the Devil's Snare. The incantation was only used in the film adaptation of Harry Potter and the Philosopher's Stone.",
    "etymology": "Derived from two words; the Latin lumen, meaning 'light', and the Latin word for 'sun', which in its accusative case is 'solem'.",
    "notes": "It is possible that the quality of the light is on the warmer solar end of the spectrum; Considering the known uses that the spell has been put to, it isn't that much of a stretch to presume that the spell is used to conjure Sunlight."
  }, 
  {
    "names": "Magicus Extremos",
    "type": "Charm",
    "description": "Seen only in the video games, this simply makes all spells more powerful for a limited period of time.",
    "mentioned": "Harry Potter and the Goblet of Fire (video game) '"
  }, 
  {
    "names": "Melofors", 
    "define": "Melofors Jinx",
    "type": "Conjuration",
    "description": "Encases the target's head in a pumpkin.",
    "mentioned": "PoA game, GoF game, Harry Potter and the Order of the Phoenix, LEGO Harry Potter: Years 1-4/5-7."
  }, 
  {
    "names": "Meteolojinx Recanto",
    "type": "Counter-Charm",
    "pronunciation": "mee-tee-OH-loh-jinks reh-CAN-toh.",
    "description": "Presumably causes weather effects caused by jinxes to cease.",
    "mentioned": "Suggested in 1997 by Arthur Weasley to Ron (disguised as Reginald Cattermole by use of Polyjuice Potion) as the best way to clear up the rain jinx on a Ministry office. Also used by Bartemius Crouch Jr (Disguised as Alastor Moody) In 1994 to cease the weather effect of the Great Hall's Ceiling insisting it is broken as he told Dumbledore to "Fix his ceiling".",
    "etymology": "Meteorology, the study of weather, the word jinx and recant, 'to withdraw or retract'. Interestingly in modern English recant means to say that you no longer hold a belief."
  }, 
  {
    "names": "Mimblewimble", 
    "define": "Tongue-Tying Curse",
    "type": "Curse",
    "pronunciation": "MIM-bull-WIM-bull",
    "description": "A curse which prevents certain information from being revealed by the individual upon whom the spell is placed. The curse manifests itself by causing the tongue to temporarily curl backwards upon itself.",
    "mentioned": "Seen in 1997 as a deterrent to Severus Snape, or any other unwanted visitor of 12 Grimmauld Place, from betraying their location to anyone else."
  }, 
  {
    "names": "Mobiliarbus",
    "type": "Charm",
    "pronunciation": "MO-bil-ee-AR-bus",
    "description": "Levitates and moves an object.",
    "mentioned": "In 1993, Hermione Granger used the spell to move a Christmas Tree in The Three Broomsticks beside her table to hide Harry Potter, who was in Hogsmeade illegally.",
    "etymology": "Latin mobilis, 'movable' or 'flexible', and arbor (alternatively arbos), 'tree'.",
    "notes": "It is possible that Mobilicorpus and Mobiliarbus are variations of the same basic spell, since they share the 'Mobili-' stem."
  }, 
  {
    "names": "Mobilicorpus",
    "type": "Charm",
    "pronunciation": "MO-bil-ee-COR-pus",
    "description": "Levitates and moves bodies.",
    "mentioned": "Sirius Black used it on Severus Snape in 1994. It was probably used on Peter Pettigrew by Lord Voldemort in the graveyard to make him come forward.",
    "etymology": "Latin mobilis, 'movable', and corpus, 'body'.",
    "notes": "It is possible that Mobiliarbus and Mobilicorpus are variations of the same basic spell, since they share the 'Mobili-' stem."
  }, 
  {
    "define": "Molly Weasley's Curse",
    "type": "Curse",
    "pronunciation": "Unknown",
    "description": "Like the Avada Kedavra curse, it kills (or freezes) the victim. It turns the body grey/blue (or paler) while it turns to stone and then another twin jinx can blast the body into pieces.",
    "mentioned": "Molly Weasley used the curse after Bellatrix Lestrange attacked Ginny Weasley. Only used in the film version.",
    "notes": "This may be Duro or a Freezing Charm, although the latter is shown to be blue in 1992."
  }, 
  {
    "names": "Morsmordre",
    "define": "Dark Mark",
    "pronunciation": "morz-MOR-duh, morz-MOHR-dah, morz-MOR-drah",
    "description": "Conjures the Dark Mark, which is the sign of the Death Eaters.",
    "mentioned": "Used by Barty Crouch Jr in 1994. Also seen in 1997 over the castle to lure Albus Dumbledore to his death. It was apparently invented by Lord Voldemort.",
    "etymology": "Latin mors, 'death', and mordere, meaning 'to bite' (or its French derivative mordre); this would appear to be associated with the name of Lord Voldemort's followers, the Death Eaters. The English murder might also contribute.",
    "notes": "A possible translation might be 'take a bite out of death', a fitting phrase for Death Eaters."
  }, 
  {
    "names": "Muffliato",
    "type": "Charm",
    "pronunciation": "muf-lee-AH-to",
    "description": "This spell fills peoples' ears with an unidentifiable buzzing to keep them from hearing nearby conversations.",
    "mentioned": "It was used in 1996 by Harry Potter and Ron Weasley on various teachers and people such as Madam Pomfrey. It was created by Severus Snape. As pointed out by Hermione, it is probably not Ministry of Magic approved. It was also used in 1997 by Hermione Granger in protection of the camp-site where Harry and she stayed in hiding.",
    "etymology": "English muffle, 'to quiet', with a pseudo-Latin or pseudo-Italian ending."
  }, 
  {
    "names": "Multicorfors",
    "type": "Transfiguration",
    "pronunciation": "mull-tee-COR-fors",
    "description": "Multicorfors is a charm used to change the colour of one's clothing.",
    "mentioned": "It can be bought at Wiseacre's Wizarding Equipment in Diagon Alley in LEGO Harry Potter: Years 1-4. It may also be the same charm as when Harry accidentally changed the colour of his eyebrow, before he asked Luna to Slughorn's Christmas party. (Unlikely, as that was performed as a Transfiguration exercise, which is rather unrelated to Charms.) Could have possibly been used when Harry accidentally changed the colour of his teachers hair, in his Primary School."
  }
]
